app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
        def authenticate_request
            header = request.headers["Authorization"]
            if header.nil? || header.blank?
                render json: { error: 'Unauthorized' }, status: :unauthorized
            else
                header = header.split(" ").last
                begin
                    decoded = jwt_decode(header)
                    @current_user = User.find(decoded[:user_id])