app/controllers/job_posts_controller.rb

SELECT "job_posts".* FROM "job_posts"
---
    def index
        @job_posts = JobPost.all

INSERT INTO "job_posts" ("title", "description", "date_posted", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"
---
    def create
        @job_post = JobPost.new(job_post_params)
        @job_post.user = @current_user
        if @job_post.save