app/controllers/job_applications_controller.rb

    def create
      job_application = current_user.job_applications.build(job_application_params)
      job_application.status = false # Default status is "Not Seen"

      if job_application.save
---
INSERT INTO "job_applications" ("user_id", "job_post_id", "status", "application_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["user_id", 2], ["job_post_id", 1], ["status", "Pending"], ["application_date", "2023-11-07"], ["created_at", "2023-11-07 17:34:29.642217"], ["updated_at", "2023-11-07 17:34:29.642217"]]