app/controllers/users_controller.rb

    def create
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("email", "created_at", "updated_at", "password_digest", "role", "admin") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["email", "admin@example.com"], ["created_at", "2023-11-07 14:23:32.403794"], ["updated_at", "2023-11-07 14:23:32.403794"], ["password_digest", "[FILTERED]"], ["role", "admin"], ["admin", 0]]