app/controllers/users_controller.rb

    def create
        user = User.new(user_params)
        user.admin = params[:user][:admin] == "false"

        if user.save
---
INSERT INTO "users" ("email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?) RETURNING "id"  [["email", "rakadissam@example.com"], ["created_at", "2023-11-05 23:40:29.866878"], ["updated_at", "2023-11-05 23:40:29.866878"], ["password_digest", "[FILTERED]"]]